Chapter 4 readme finalize
